{"id": "brain_overview", "timestamp": 1762436538.0, "domain": "science", "content": "The human brain is a complex organ that controls thought, memory, emotion, touch, motor skills, vision, breathing, temperature, hunger and every process that regulates the body; together with the spinal cord it forms the central nervous system【247307900032812†L63-L66】.", "confidence": 0.91, "verification_level": "validated", "source": "Johns Hopkins Medicine brain anatomy article", "validated_by": "unknown", "metadata": {"tier": "stm"}}
{"id": "cerebrum_overview", "timestamp": 1762436538.0, "domain": "science", "content": "The cerebrum is the largest part of the brain. It consists of an outer gray matter cerebral cortex and inner white matter. The cerebrum initiates and coordinates movement and regulates temperature; other areas enable speech, judgment, thinking, reasoning, problem-solving, emotions, learning, and the senses of vision, hearing and touch【247307900032812†L119-L124】. The cerebrum performs higher functions including interpreting touch, vision and hearing, speech, reasoning, emotions, learning and fine control of movement【568786173123349†L65-L68】.", "confidence": 0.9, "verification_level": "validated", "source": "Johns Hopkins Medicine and Mayfield Clinic", "validated_by": "unknown", "metadata": {"tier": "stm"}}
{"id": "cerebellum_overview", "timestamp": 1762436538.0, "domain": "science", "content": "The cerebellum is a fist-sized structure located at the back of the head, beneath the temporal and occipital lobes and above the brainstem. It coordinates voluntary muscle movements and maintains posture, balance and equilibrium【247307900032812†L169-L175】. The cerebellum is located under the cerebrum and its function is to coordinate muscle movements and maintain posture and balance【568786173123349†L69-L72】.", "confidence": 0.9, "verification_level": "validated", "source": "Johns Hopkins Medicine and Mayfield Clinic", "validated_by": "unknown", "metadata": {"tier": "stm"}}
{"id": "brainstem_overview", "timestamp": 1762436538.0, "domain": "science", "content": "The brainstem connects the cerebrum with the spinal cord and consists of the midbrain, pons and medulla. It acts as a relay center and controls vital automatic functions such as breathing, heart rate, blood flow, body temperature, wake-sleep cycles, digestion and reflexes like sneezing, coughing, vomiting and swallowing【247307900032812†L143-L160】【568786173123349†L73-L76】.", "confidence": 0.9, "verification_level": "validated", "source": "Johns Hopkins Medicine and Mayfield Clinic", "validated_by": "unknown", "metadata": {"tier": "stm"}}
{"id": "brain_lobes", "timestamp": 1762436538.0, "domain": "science", "content": "Each cerebral hemisphere is divided into four lobes. The frontal lobe, at the front of the brain, is involved in personality, decision-making and movement and contains Broca’s area for speech【247307900032812†L207-L211】. The parietal lobe helps identify objects, understand spatial relationships and interpret pain and touch; it houses Wernicke’s area for language comprehension【247307900032812†L212-L215】. The occipital lobe, at the back of the brain, processes vision【247307900032812†L217-L218】. The temporal lobes, on the sides of the brain, support short-term memory, speech, musical rhythm and aspects of smell recognition【247307900032812†L219-L220】.", "confidence": 0.9, "verification_level": "validated", "source": "Johns Hopkins Medicine", "validated_by": "unknown", "metadata": {"tier": "stm"}}
{"id": "pituitary_gland", "timestamp": 1762436538.0, "domain": "science", "content": "The pituitary gland, sometimes called the master gland, is a pea-sized structure located deep in the brain behind the bridge of the nose. It controls the function of other endocrine glands by secreting hormones and receives chemical signals from the hypothalamus through its stalk and blood supply【247307900032812†L226-L230】【568786173123349†L204-L208】.", "confidence": 0.89, "verification_level": "validated", "source": "Johns Hopkins Medicine and Mayfield Clinic", "validated_by": "unknown", "metadata": {"tier": "stm"}}
{"id": "hypothalamus", "timestamp": 1762436538.0, "domain": "science", "content": "The hypothalamus is located above the pituitary gland and regulates body temperature, synchronizes sleep patterns, controls hunger and thirst and plays a role in memory and emotion【247307900032812†L234-L237】. It serves as the master control of the autonomic system, influencing behaviors such as hunger, thirst, sleep and sexual response, and it regulates temperature, blood pressure, emotions and hormone secretion【568786173123349†L199-L203】.", "confidence": 0.89, "verification_level": "validated", "source": "Johns Hopkins Medicine and Mayfield Clinic", "validated_by": "unknown", "metadata": {"tier": "stm"}}
{"id": "amygdala", "timestamp": 1762436538.0, "domain": "science", "content": "The amygdala consists of small almond‑shaped structures under each hemisphere. It regulates emotion and memory and is associated with the brain’s reward system, stress response and the fight‑or‑flight reaction【247307900032812†L241-L244】.", "confidence": 0.88, "verification_level": "validated", "source": "Johns Hopkins Medicine", "validated_by": "unknown", "metadata": {"tier": "stm"}}
{"id": "hippocampus", "timestamp": 1762436538.0, "domain": "science", "content": "The hippocampus is a curved seahorse-shaped organ on the underside of each temporal lobe. It supports memory, learning, navigation and spatial perception and is part of the hippocampal formation【247307900032812†L248-L251】.", "confidence": 0.88, "verification_level": "validated", "source": "Johns Hopkins Medicine", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "meningeal_layers", "timestamp": 1762436538.0, "domain": "science", "content": "Between the skull and the brain are three protective membranes called meninges. The dura mater forms a tough outer layer lining the cranial vault, the arachnoid membrane is a thin middle layer covering the entire brain, and the pia mater is the delicate innermost layer that contains blood vessels running along the brain’s surface【679332957859059†L67-L68】.", "confidence": 0.87, "verification_level": "validated", "source": "Cleveland Clinic brain anatomy article", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "gray_white_matter", "timestamp": 1762436538.0, "domain": "science", "content": "The brain contains two main tissue types: gray matter and white matter. Gray matter consists of neuron cell bodies that form the cerebral cortex and handle functions such as muscle control, senses, memory, emotion and speech. White matter lies beneath the cortex and is made of myelinated axons that transmit signals between regions of the central nervous system【679332957859059†L76-L78】.", "confidence": 0.87, "verification_level": "validated", "source": "Cleveland Clinic brain anatomy article", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "neurons_and_glia", "timestamp": 1762436538.0, "domain": "science", "content": "The human brain contains roughly 86 billion neurons and a comparable number of non‑neuronal glial cells. Neurons are specialized cells that send and receive electrical and chemical signals, while glial cells maintain and nourish the brain, form the myelin that insulates nerve fibers and support neuronal function【679332957859059†L78-L79】.", "confidence": 0.87, "verification_level": "validated", "source": "Cleveland Clinic brain anatomy article", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "thalamus", "timestamp": 1762436538.0, "domain": "science", "content": "The thalamus consists of two oval masses in the core of the brain above the brainstem. These nuclei act as a relay and sorting station for sensory signals – they receive input from the eyes, ears, taste buds and skin and route it to the cerebral cortex. The thalamus also conveys sensory information about pain, temperature and pressure and relays motor impulses from the cerebral hemispheres to appropriate targets【832073064741487†L179-L187】.", "confidence": 0.87, "verification_level": "validated", "source": "NCBI Bookshelf – Major Structures and Functions of the Brain", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "hypothalamus_detailed", "timestamp": 1762436538.0, "domain": "science", "content": "The hypothalamus is a thumb‑sized structure below the thalamus that serves as the main interface between the nervous and endocrine systems. It regulates autonomic functions by stimulating smooth muscle in the blood vessels, stomach and bladder and monitors internal body states such as temperature and blood composition. The hypothalamus detects changes and responds by triggering hormonal release, translating emotional signals from the cerebral cortex into physical responses like increased heart rate, and controlling drives such as hunger, thirst, satiety and sleep【832073064741487†L189-L224】.", "confidence": 0.87, "verification_level": "validated", "source": "NCBI Bookshelf – Major Structures and Functions of the Brain", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "pituitary_and_pineal", "timestamp": 1762436538.0, "domain": "science", "content": "The pituitary gland sits below the hypothalamus and responds to hypothalamic signals by releasing hormones that control other endocrine glands. These include thyroid‑stimulating hormone, adrenocorticotropic hormone, prolactin, growth hormone and sex hormones. The pineal gland, located behind the corpus callosum, secretes melatonin, a hormone whose levels rise at night and help regulate sleep–wake cycles【832073064741487†L254-L276】.", "confidence": 0.86, "verification_level": "validated", "source": "NCBI Bookshelf – Major Structures and Functions of the Brain", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "basal_ganglia", "timestamp": 1762436538.0, "domain": "science", "content": "The basal ganglia are deep clusters of gray matter within each cerebral hemisphere, including the striatum, globus pallidus, substantia nigra and subthalamic nucleus. They are thought to play a key role in action selection: by exerting a tonic inhibitory influence over motor systems and selectively releasing this inhibition, the basal ganglia help choose and initiate smooth voluntary movements. They also interact with the prefrontal cortex to influence cognition and behaviour and form part of reward pathways【872414101832004†L232-L242】.", "confidence": 0.86, "verification_level": "validated", "source": "Wikipedia – Basal ganglia", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "cerebellum_detailed", "timestamp": 1762436538.0, "domain": "science", "content": "The cerebellum, often called the ‘little brain,’ is tucked under the cerebral hemispheres at the back of the head and is the second‑largest part of the brain. It processes and coordinates information required to maintain balance and posture and to execute smooth, coordinated movements. The cerebellum relays impulses for movement from the motor cortex to the spinal cord and simultaneously receives sensory feedback from muscles and joints; by comparing instructions and feedback it can fine‑tune ongoing movements【832073064741487†L283-L301】.", "confidence": 0.87, "verification_level": "validated", "source": "NCBI Bookshelf – Major Structures and Functions of the Brain", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "glia_overview", "timestamp": 1762436538.0, "domain": "science", "content": "Glia are non‑neuronal cells of the brain and nervous system. Unlike neurons, glia do not generate action potentials but instead support and protect neurons. They were once thought to be mere housekeepers but are now recognised as key components of synapses. Glial cells come in several subtypes, each specialised for particular functions【481034859015137†L146-L160】.", "confidence": 0.85, "verification_level": "validated", "source": "Queensland Brain Institute – What are glia?", "validated_by": "unknown", "metadata": {"tier": "stm"}}


{"id": "astrocytes", "timestamp": 1762436538.0, "domain": "science", "content": "Astrocytes are star‑shaped glial cells that maintain a neuron’s working environment. They regulate neurotransmitter levels at synapses, control concentrations of important ions such as potassium and provide metabolic support. Astrocytes can sense neurotransmitter levels and release molecules that directly influence neuronal activity, making them important modulators of synapses【750281734454517†L173-L183】.", "confidence": 0.85, "verification_level": "validated", "source": "Queensland Brain Institute – Types of glia", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "oligodendrocytes", "timestamp": 1762436538.0, "domain": "science", "content": "Oligodendrocytes are glial cells that support axons in the central nervous system. They produce the fatty myelin sheath that wraps around axons like insulation, allowing electrical messages to travel faster and giving white matter its name. Loss of the myelin sheath, such as in multiple sclerosis, disrupts signal transmission【750281734454517†L187-L194】.", "confidence": 0.85, "verification_level": "validated", "source": "Queensland Brain Institute – Types of glia", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "microglia", "timestamp": 1762436538.0, "domain": "science", "content": "Microglia serve as the brain’s immune cells. They detect injury or disease and remove toxic agents and dead cells, protecting the brain. In some neurodegenerative disorders, microglia may become hyperactivated and promote neuroinflammation, contributing to the buildup of toxic protein deposits【750281734454517†L154-L163】.", "confidence": 0.84, "verification_level": "validated", "source": "Queensland Brain Institute – Types of glia", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "ependymal_cells", "timestamp": 1762436538.0, "domain": "science", "content": "Ependymal cells line the spinal cord and the ventricles of the brain. They are involved in creating cerebrospinal fluid, which cushions the brain and spinal cord and circulates nutrients and waste products【750281734454517†L207-L210】.", "confidence": 0.84, "verification_level": "validated", "source": "Queensland Brain Institute – Types of glia", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "radial_glia", "timestamp": 1762436538.0, "domain": "science", "content": "Radial glial cells are progenitor cells in the developing nervous system. They act as neural stem cells that can generate neurons, astrocytes and oligodendrocytes during development【750281734454517†L207-L210】.", "confidence": 0.83, "verification_level": "validated", "source": "Queensland Brain Institute – Types of glia", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "schwann_cells", "timestamp": 1762436538.0, "domain": "science", "content": "Schwann cells are glial cells of the peripheral nervous system that wrap around and myelinate peripheral nerves, similar to the function of oligodendrocytes in the central nervous system【750281734454517†L214-L216】.", "confidence": 0.83, "verification_level": "validated", "source": "Queensland Brain Institute – Types of glia", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "satellite_cells", "timestamp": 1762436538.0, "domain": "science", "content": "Satellite cells surround neurons in the sensory, sympathetic and parasympathetic ganglia of the peripheral nervous system. They help regulate the chemical environment around these neurons and may contribute to chronic pain【750281734454517†L214-L218】.", "confidence": 0.82, "verification_level": "validated", "source": "Queensland Brain Institute – Types of glia", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "enteric_glial_cells", "timestamp": 1762436538.0, "domain": "science", "content": "Enteric glial cells are glia located in the nerves of the digestive system (enteric nervous system), where they support neuronal function in the gut【750281734454517†L214-L220】.", "confidence": 0.82, "verification_level": "validated", "source": "Queensland Brain Institute – Types of glia", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "blood_brain_barrier", "timestamp": 1762436538.0, "domain": "science", "content": "The blood‑brain barrier is a protective layer of tightly locked endothelial cells lining the inner surfaces of the brain’s blood vessels. It acts like a filter or gatekeeper, keeping harmful substances, germs and toxins out of the brain while holding beneficial chemicals in and maintaining the brain’s delicate chemical balance. Only small or lipid‑soluble molecules can pass through easily; larger or water‑soluble molecules require transport, and pathogens generally cannot cross【229246703460923†L70-L116】.", "confidence": 0.85, "verification_level": "validated", "source": "Cleveland Clinic – Blood‑Brain Barrier", "validated_by": "unknown", "metadata": {"tier": "stm"}}

{"id": "limbic_system", "timestamp": 1762436538.0, "domain": "science", "content": "The limbic system is a group of interconnected brain structures deep within the forebrain that regulate emotions, behaviours, motivation and memory. It is one of the oldest parts of the brain and triggers instinctive survival behaviours such as eating, reproducing and reacting to danger. The limbic system processes information and then directs the body to respond; it is sometimes called the emotional nervous system. Its main functions include processing emotions, behaviours, motivations, memory and autonomic nervous system responses, such as controlling hunger, thirst, pain, pleasure and sexual arousal【793878134037747†L43-L99】【793878134037747†L130-L138】. The major components of the limbic system are the hypothalamus (regulates hormones and drives like hunger, thirst and sexual arousal), the amygdala (processes emotions like anxiety, anger and fear and plays a role in memory and social interpretation), the thalamus (relays sensory information and helps with memory and emotions) and the hippocampus (critical for forming new memories)【793878134037747†L170-L179】.", "confidence": 0.85, "verification_level": "validated", "source": "Cleveland Clinic – Limbic System", "validated_by": "unknown", "metadata": {"tier": "stm"}}